; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-6-11)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-2 - location
	p0-4 - location
	p1-3 - location
	p1-4 - location
	p2-1 - location
	p4-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s3)
	(at driver3 s0)
	(at driver4 s3)
	(at driver5 s1)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at package1 s4)
	(at package2 s1)
	(at package3 s1)
	(at package4 s2)
	(at package5 s2)
	(at package6 s2)
	(at package7 s3)
	(at package8 s0)
	(at package9 s0)
	(at package10 s1)
	(at package11 s3)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(= (time-to-walk s0 p0-2) 55)
	(= (time-to-walk p0-2 s0) 55)
	(= (time-to-walk s2 p0-2) 77)
	(= (time-to-walk p0-2 s2) 77)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 30)
	(= (time-to-walk p0-4 s0) 30)
	(= (time-to-walk s4 p0-4) 63)
	(= (time-to-walk p0-4 s4) 63)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 12)
	(= (time-to-walk p1-3 s1) 12)
	(= (time-to-walk s3 p1-3) 66)
	(= (time-to-walk p1-3 s3) 66)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 53)
	(= (time-to-walk p1-4 s1) 53)
	(= (time-to-walk s4 p1-4) 55)
	(= (time-to-walk p1-4 s4) 55)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 40)
	(= (time-to-walk p2-1 s2) 40)
	(= (time-to-walk s1 p2-1) 78)
	(= (time-to-walk p2-1 s1) 78)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 13)
	(= (time-to-walk p4-3 s4) 13)
	(= (time-to-walk s3 p4-3) 4)
	(= (time-to-walk p4-3 s3) 4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 46)
	(= (time-to-drive s1 s0) 46)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 59)
	(= (time-to-drive s2 s0) 59)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 18)
	(= (time-to-drive s3 s0) 18)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 15)
	(= (time-to-drive s4 s0) 15)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 22)
	(= (time-to-drive s4 s1) 22)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 58)
	(= (time-to-drive s2 s3) 58)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s1)
	(at truck1 s2)
	(at truck3 s3)
	(at truck6 s3)
	(at package1 s2)
	(at package2 s2)
	(at package3 s1)
	(at package4 s3)
	(at package5 s3)
	(at package6 s0)
	(at package7 s1)
	(at package8 s3)
	(at package9 s4)
	(at package10 s2)
	(at package11 s2)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 1  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver3 truck5 s0)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 2 of 15
2. (load-truck package6 truck2 s2)
   deleted: (at package6 s2)
   added: (in package6 truck2)
   goals met: 2 of 15
3. (load-truck package4 truck2 s2)
   deleted: (at package4 s2)
   added: (in package4 truck2)
   goals met: 2 of 15
4. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   goals met: 2 of 15
5. (load-truck package8 truck5 s0)
   deleted: (at package8 s0)
   added: (in package8 truck5)
   goals met: 2 of 15
6. (load-truck package9 truck5 s0)
   deleted: (at package9 s0)
   added: (in package9 truck5)
   goals met: 2 of 15
7. (walk driver5 s1 p1-4)
   deleted: (at driver5 s1)
   added: (at driver5 p1-4)
   changed: (walked) from 0 to 53
   goals met: 2 of 15
8. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 15
9. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (driven) from 0 to 58
   goals met: 2 of 15
10. (walk driver5 p1-4 s4)
   deleted: (at driver5 p1-4)
   added: (at driver5 s4)
   changed: (walked) from 53 to 108
   goals met: 2 of 15
11. (walk driver2 s3 p1-3)
   deleted: (at driver2 s3)
   added: (at driver2 p1-3)
   changed: (walked) from 108 to 174
   goals met: 2 of 15
12. (walk driver2 p1-3 s1)
   deleted: (at driver2 p1-3)
   added: (at driver2 s1)
   changed: (walked) from 174 to 186
   goals met: 3 of 15
13. (unload-truck package4 truck2 s3)
   deleted: (in package4 truck2)
   added: (at package4 s3)
   goals met: 4 of 15
14. (unload-truck package5 truck2 s3)
   deleted: (in package5 truck2)
   added: (at package5 s3)
   goals met: 5 of 15
15. (load-truck package11 truck2 s3)
   deleted: (at package11 s3)
   added: (in package11 truck2)
   goals met: 5 of 15
16. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 58 to 76
   goals met: 5 of 15
17. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   goals met: 6 of 15
18. (board-truck driver5 truck1 s4)
   deleted: (at driver5 s4) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 6 of 15
19. (drive-truck truck5 s0 s3 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   changed: (driven) from 76 to 94
   goals met: 6 of 15
20. (unload-truck package8 truck5 s3)
   deleted: (in package8 truck5)
   added: (at package8 s3)
   goals met: 7 of 15
21. (load-truck package7 truck5 s3)
   deleted: (at package7 s3)
   added: (in package7 truck5)
   goals met: 7 of 15
22. (drive-truck truck2 s0 s2 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (driven) from 94 to 153
   goals met: 7 of 15
23. (drive-truck truck5 s3 s0 driver3)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   changed: (driven) from 153 to 171
   goals met: 7 of 15
24. (drive-truck truck1 s4 s0 driver5)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (driven) from 171 to 186
   goals met: 7 of 15
25. (unload-truck package11 truck2 s2)
   deleted: (in package11 truck2)
   added: (at package11 s2)
   goals met: 8 of 15
26. (drive-truck truck1 s0 s2 driver5)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 186 to 245
   goals met: 9 of 15
27. (drive-truck truck5 s0 s4 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   changed: (driven) from 245 to 260
   goals met: 9 of 15
28. (unload-truck package9 truck5 s4)
   deleted: (in package9 truck5)
   added: (at package9 s4)
   goals met: 10 of 15
29. (load-truck package1 truck5 s4)
   deleted: (at package1 s4)
   added: (in package1 truck5)
   goals met: 10 of 15
30. (drive-truck truck5 s4 s0 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   changed: (driven) from 260 to 275
   goals met: 10 of 15
31. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 9 of 15
32. (drive-truck truck5 s0 s1 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (driven) from 275 to 321
   goals met: 9 of 15
33. (unload-truck package7 truck5 s1)
   deleted: (in package7 truck5)
   added: (at package7 s1)
   goals met: 10 of 15
34. (load-truck package2 truck5 s1)
   deleted: (at package2 s1)
   added: (in package2 truck5)
   goals met: 10 of 15
35. (load-truck package10 truck5 s1)
   deleted: (at package10 s1)
   added: (in package10 truck5)
   goals met: 10 of 15
36. (drive-truck truck5 s1 s0 driver3)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   changed: (driven) from 321 to 367
   goals met: 10 of 15
37. (drive-truck truck5 s0 s2 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (driven) from 367 to 426
   goals met: 10 of 15
38. (unload-truck package2 truck5 s2)
   deleted: (in package2 truck5)
   added: (at package2 s2)
   goals met: 11 of 15
39. (unload-truck package10 truck5 s2)
   deleted: (in package10 truck5)
   added: (at package10 s2)
   goals met: 12 of 15
40. (unload-truck package1 truck5 s2)
   deleted: (in package1 truck5)
   added: (at package1 s2)
   goals met: 13 of 15
41. (drive-truck truck3 s1 s0 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (driven) from 426 to 472
   goals met: 13 of 15
42. (drive-truck truck3 s0 s3 driver2)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   changed: (driven) from 472 to 490
   goals met: 14 of 15
43. (disembark-truck driver2 truck3 s3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s3) (empty truck3)
   goals met: 14 of 15
44. (walk driver2 s3 p1-3)
   deleted: (at driver2 s3)
   added: (at driver2 p1-3)
   changed: (walked) from 186 to 252
   goals met: 14 of 15
45. (walk driver2 p1-3 s1)
   deleted: (at driver2 p1-3)
   added: (at driver2 s1)
   changed: (walked) from 252 to 264
   goals met: 15 of 15
